from math import *

i = 9.5
print(f"округляем в вверх {ceil(i)}")
print(f"округляем в вниз {floor(i)}")

i1 = ceil(11.5)
i2 = floor(11.5)
print(f"округляем в вверх {i1}")
print(f"в вниз {i2}")

N = 1024
i = log2(N)
print(f"{i} бит")

N = 1024 + 10
i = ceil(log2(N))
print(f"{i} бит")

# ? Практика

'''
Задача 1
При регистрации в компьютерной системе каждому объекту присваивается идентификатор, содержащий десятичные цифры, 
26 латинских букв в верхнем регистре и символы из 2013-символьного специального алфавита. 
В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное число байт. 
При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым 
и минимально возможным числом бит. Известно, что для хранения 2050 идентификаторов отведено более 709 Кбайт памяти. 
Определите минимально возможную длину идентификатора. В ответе запишите только целое число
'''
from math import *
N = 10 + 26 + 2013
i = ceil(log2(N)) # бит
print(f"i={i} бит")

n = 2050
V = 709 * 1024
I = ceil(V / n)
print(f"I={I} байт")

L = I * 8 / i
print(f"L={L} символ")
print(ceil(L) * i / 8)
print(floor(L) * i / 8)

'''
Задача 2 

На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 105 символов.
В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
Известно, что для хранения 65 536 серийных номеров потребовалось не менее 7 Мбайт памяти.
Определите минимально возможную мощность алфавита, используемого для записи серийных номеров.
В ответе запишите только целое число.
'''
L = 105
n = 65536
V = 7 * 2**20
I = ceil(V / n)
print(f"I={I} байт")
i = I * 8 / L
print(f"i={i} бит")
print(ceil(i) * L / 8)
print(floor(i) * L / 8)
print(f"N={2**ceil(i-1)+1} ")
