# цикл for
# for i in range(5):
#     print(i)
for i in range(10, 20)
    print(i)

for i in range(30, 40, 2):
    print(i)

for i in range(15):
    print("ищу")
    if i == 8:
        print("нашел")
        break

# ? Практика
'''
На предприятии каждой изготовленной детали присваивают серийный номер, содержащий десятичные цифры и 
символы из 17-символьного специального алфавита. В базе данных каждый серийный номер занимает одинаковое 
и минимально возможное число байт. При этом используется посимвольное кодирование серийных номеров, 
все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 
7 564 230 серийных номеров требуется более 31 Мбайт памяти.
Определите минимально возможную длину серийного номера
'''