# цикл for
# for i in range(5):
#     print(i)
# for i in range(10, 20)
#     print(i)
#
# for i in range(30, 40, 2):
#     print(i)
#
# for i in range(15):
#     print("ищу")
#     if i == 8:
#         print("нашел")
#         break
#
# # ? Практика
# '''
# На предприятии каждой изготовленной детали присваивают серийный номер, содержащий десятичные цифры и
# символы из 17-символьного специального алфавита. В базе данных каждый серийный номер занимает одинаковое
# и минимально возможное число байт. При этом используется посимвольное кодирование серийных номеров,
# все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения
# 7 564 230 серийных номеров требуется более 31 Мбайт памяти.
# Определите минимально возможную длину серийного номера
# '''


from math import*

N = 17 + 10
i = ceil(log2(N))
n = 7564230
V = 31 * 2**20
for L in range (1, 100):
    I = ceil(L * i / 8)
    if I * n > V:
        print(L)
        break

# # 1 дз 9738
# h = 1024
# w = 768
# i = 3 * 8
# q = 65536
# V = h * w * i
# print(V)
# t = V / q
# print(t)

# # 2 дз 1851
# h = 315
# w = 3072
# V = 735 * 2**13
# k = h * w
# i = floor(V / k)
# print(i)

# # 3 дз 17861
# h = 1024
# w = 768
# N = 4096
# i = ceil(log2(N))
# q = 1310720
# t = 300
# V1 = h * w * i
# V2 = q * t
# k = floor(V2 / V1)
# print(k)

# # 4 дз 7001
# L = 305
# N = 2040 + 10
# i = ceil(log2(N ))
# I = ceil(L * i / 8)
# n = 32768
# V = n * I // 2**10
# print(V)

# # 5 дз 8155
# L = 213
# N = 1780 + 10
# n = 16384
# i = ceil(log2(N))
# I = ceil(L * i / 8)
# V = n * I / 2**10
# print(V)


