s = "LBDEFsdfsf"
# срезы
print(s[0])
print(s[2:5])
print(s[1:6:2])
print(s[1:])
print(s[:4])
print(s[-1])
print(s[-4:-2])

# переворачивает строку
print(s[::-1])

# длина строки
m = len(s)
print(m)

# в верхнем регистре большие и маленькие буквы
print(s.upper())
print(s.lower())

# перебор символов
for i in s:
    print(i)

# замена символов
s = "AABDDBHH"
s = s.replace("B", "")
print(s)

s = "AABDDBHH"
s = s.replace("AA", "*")
print(s)

# списки
array = list()
arrey =[]
array =[5, "er", 20, 30]
print(array[0:4])

for i in array:
    print(i)

# из строки в списк  по критериям
s = "AAA DDDD B HH"
l = s.split()
print(l)

s = "AAA.DDDD.B.HH"
l = s.split('.')
print(l)

'''
Программа ищет в строке последовательности 6666 и 99.
Если найдено 6666, она заменяет первое такое вхождение на 99. Если 6666 больше нет, но есть 99,
заменяет первое вхождение 99 на 6. 
Цикл продолжается, пока в строке встречается хотя бы одна из цепочек.
'''

s = "6666" * 10 + "99" * 10
while "6666" in s or "99" in s:
    s = s.replace ("6666", "99")
    s = s.replace ("99", "6")
print(s)

'''
Программа ищет в строке последовательности 55555 и 333. Если найдено 55555, она заменяет первое такое вхождение на 33.
Если 55555 больше нет, но есть 333, заменяет первое вхождение 333 на 5.
Цикл продолжается, пока в строке встречается хотя бы одна из цепочек.
'''

s = "55555" * 10 + "333" * 10
while "55555" in s or "333" in s:
    s = s.replace ("55555", "333")
    s = s.replace ("333", "5")
print(s)

'''
Программа ищет в строке последовательности 10 и 1. Если найдено 10, она заменяет первое такое вхождение на 000.
Если 10 больше нет, но есть 1, заменяет первое вхождение 1 на 00. Цикл продолжается, 
пока в строке встречается хотя бы одна единица.
Входная строка состоит из одной цифры 1, за которой следуют 45 нулей. Определите количество нулей в итоговой строке.
'''

s = "1" + "0" * 45
while "1" in s or "10" in s:
    s = s.replace("10", "000")
    s = s.replace("1", "00")
print(s)

'''
Программа ищет в строке последовательности 12, 322 и 222. Если найдено 12, она заменяет первое такое вхождение на 2.
Если найдено 322, она заменяет первое такое вхождение на 21. Если найдено 222, она заменяет первое такое вхождение на 3.
Цикл продолжается, пока в строке встречается хотя бы одна из цепочек.
Входная строка: цифра 1, за которой следуют 30 двоек (итого 31 символ). Определите сумму цифр итоговой строки
'''

s = "1" + "2" * 30
while "12" in s or "322" in s or "222" in s:
    s = s.replace("12", "2")
    s = s.replace("322", "21")
    s = s.replace("222", "3")
print(s)